{
  "last_node_id": 51,
  "last_link_id": 54,
  "nodes": [
    {
      "id": 7,
      "type": "Note",
      "pos": [
        398,
        -255
      ],
      "size": [
        560.1107513648193,
        103.60144459895338
      ],
      "flags": {
        "collapsed": false
      },
      "order": 1,
      "mode": 0,
      "properties": {
        "text": ""
      },
      "widgets_values": [
        "当 MiniCPM VQA 同时接收到图像和视频信息时，它会仅处理视频信息而忽略图像信息。如果您想处理图像信息，请断开视频信息的输入。\n\nWhen MiniCPM VQA simultaneously receives both image and video information, it processes only the video information while ignoring the image information. If you want to process the image information, please disconnect the input of the video information."
      ],
      "color": "#432",
      "bgcolor": "#653"
    },
    {
      "id": 49,
      "type": "DisplayText",
      "pos": [
        395,
        -115
      ],
      "size": [
        565.5332447212019,
        259.1318214920463
      ],
      "flags": {},
      "order": 2,
      "mode": 0,
      "inputs": [
        {
          "name": "text",
          "type": "STRING",
          "link": 54,
          "widget": {
            "name": "text"
          }
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "type": "STRING",
          "links": null,
          "shape": 6
        }
      ],
      "properties": {
        "Node name for S&R": "DisplayText"
      },
      "widgets_values": [
        "",
        "A quantum group is a mathematical object that generalizes the concept of a classical group to the realm of quantum mechanics. In classical mathematics, a group is a set of elements with a binary operation (such as addition or multiplication) that satisfies certain properties, such as associativity and the existence of an identity element.\nIn the context of quantum mechanics, a quantum group is a Hopf algebra that is associated with a classical group. The elements of a quantum group are represented by operators that satisfy the same algebraic rules as the elements of the corresponding classical group. However, the operators in a quantum group also have additional properties related to the uncertainty principle, which is a fundamental principle in quantum mechanics that states that it is impossible to precisely measure both the position and momentum of a particle at the same time.\nOne example of a quantum group is the quantum group associated with the special unitary group SU(2), which plays a central role in the study of quantum spin systems. Another example is the quantum group associated with the orthogonal group SO(3), which is used in the study of quantum mechanics of angular momentum.\nQuantum groups have many applications in physics and other areas of mathematics, including the study of quantum field theory, integrable systems, and knot theory. They are also important tools in the development of quantum computing, where they can be used to construct quantum algorithms for solving problems that are difficult or impossible to solve using classical computers."
      ]
    },
    {
      "id": 51,
      "type": "MiniCPM_VQA",
      "pos": [
        -21,
        -256
      ],
      "size": {
        "0": 400,
        "1": 400
      },
      "flags": {},
      "order": 0,
      "mode": 0,
      "inputs": [
        {
          "name": "source_video_path",
          "type": "VIDEO",
          "link": null
        },
        {
          "name": "source_image_path_1st",
          "type": "IMAGE",
          "link": null
        },
        {
          "name": "source_image_path_2nd",
          "type": "IMAGE",
          "link": null
        },
        {
          "name": "source_image_path_3rd",
          "type": "IMAGE",
          "link": null
        }
      ],
      "outputs": [
        {
          "name": "STRING",
          "type": "STRING",
          "links": [
            54
          ],
          "shape": 3,
          "slot_index": 0
        }
      ],
      "properties": {
        "Node name for S&R": "MiniCPM_VQA"
      },
      "widgets_values": [
        "Quantum Group",
        "MiniCPM-V-2_6-int4",
        true,
        0.8,
        100,
        0.7,
        1.05,
        2048,
        64,
        2,
        1501,
        "randomize"
      ]
    }
  ],
  "links": [
    [
      54,
      51,
      0,
      49,
      0,
      "STRING"
    ]
  ],
  "groups": [],
  "config": {},
  "extra": {
    "ds": {
      "scale": 1.2839025177495011,
      "offset": [
        174.06698959850874,
        351.1944051783393
      ]
    }
  },
  "version": 0.4
}